# Explorations and Exercises
Starting off with some experiments and data science toics

### Pandas Walkthrough

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(
    {'First':['Michael', 'Johnathan', 'Anne'],
    'Last': ['Smith', 'Jordan', 'Mishael'],
    'Grades': [10, 13, 22],
    'Year': [2002, 2013, 2014]}
)
df

       First     Last  Grades  Year
0    Michael    Smith      10  2002
1  Johnathan   Jordan      13  2013
2       Anne  Mishael      22  2014

In [4]:
df.describe()

          Grades         Year
count   3.000000     3.000000
mean   15.000000  2009.666667
std     6.244998     6.658328
min    10.000000  2002.000000
25%    11.500000  2007.500000
50%    13.000000  2013.000000
75%    17.500000  2013.500000
max    22.000000  2014.000000